string = input("Please enter string: ")

# Виведіть третій символ цього рядка
print(string[2])
# виведіть передостанній символ цього рядка
print(string[-2])
# виведіть перші п'ять символів цього рядка
print(string[:5])
# виведіть весь рядок, крім двох останніх символів
print(string[:-2])
# виведіть усі символи з парними індексами
print(string[2::2])
# виведіть усі символи з непарними індексами
print(string[1::2])
# виведіть усі символи у зворотному порядку
print(string[::-1])
# виведіть усі символи рядка через один у зворотному порядку, починаючи з останнього
print(string[::-2])
# виведіть довжину цього рядка
print(len(string))
